{
  "exam": {
    "id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
    "name": "Customized Mock",
    "year": 2026,
    "exam_type": "CAT",
    "slot": "Custom",
    "is_official": false,
    "created_at": "2026-01-19T20:23:46.889Z",
    "used_articles_id": [
      "0cec64e0-4830-43a0-9eeb-bb785e26b1a9",
      "5764bf18-7d46-4e57-a183-64e5034b0a6d",
      "1ec2b3b9-6651-479d-80aa-f556de2ddcfd",
      "8a043b60-2cfa-435e-880c-4fa22dd1e7ba"
    ],
    "generated_by_user_id": "1962e072-bcc0-48f4-8376-6c968d406cbe",
    "time_limit_minutes": 40
  },
  "passages": [
    {
      "id": "cd52c937-2c92-4a29-8630-71ee516d67a2",
      "title": "Passage 1",
      "content": "The evolution of cognition has long been framed within a narrative that privileges complex organisms, particularly mammals, as the exclusive bearers of advanced cognitive faculties. This perspective, however, is increasingly being challenged by a growing body of evidence suggesting that cognitive capacities may have deeper, more primitive roots. Darwin's theory of the continuity of mental evolution posits that cognitive traits are not unique to humans but are present in various forms throughout the tree of life. This assertion fundamentally alters our understanding of cognition, inviting a reevaluation of what it means to think and to be aware. The implications of this shift are profound; they suggest that cognition is not a sudden emergence in certain species but rather a gradual evolutionary development that spans millions of years.\n\nThe traditional cognitivist paradigm, which frames cognition as computation over representations, has been increasingly scrutinized in light of findings from simpler organisms. For instance, studies on bacteria and C. elegans have revealed behaviors that exhibit cognitive-like characteristics, challenging the notion that such capacities are exclusive to organisms with complex nervous systems. This raises critical questions about the very definition of cognition: if simple organisms can display behaviors that suggest cognitive processes, what does this imply about the thresholds we have established for cognitive capabilities? The prevailing view that cognition is a hallmark of higher animals is not only misleading but also insufficient for capturing the full spectrum of cognitive evolution.\n\nMoreover, the emergence of spontaneous brain activity, exemplified by the default mode network, further complicates our understanding of cognitive processes. Traditionally, cognition has been viewed as a reactive mechanism, responding to external stimuli. However, the discovery of spontaneous brain activity suggests that cognitive processes may involve ongoing internal dynamics that are not merely reactive. This challenges the assumption that cognition is solely a product of environmental interactions and invites a more nuanced understanding of how cognitive processes operate across different species. The implications of this are significant; they suggest that cognitive processes may be more about internal states than previously acknowledged, thus requiring a reevaluation of how we define and study cognition.\n\nIn light of these developments, it becomes essential to consider the challenges faced by cognitive neuroscience in understanding the functional units of the brain. The relationship between neural structures and cognitive capacities remains ambiguous, particularly when examining how simpler organisms exhibit behaviors that suggest cognitive functions. This ambiguity is compounded by the fact that our current models of cognition are often predicated on human-centric frameworks, which may not adequately account for the diversity of cognitive expressions found in nature. The assumption that higher cognitive functions are exclusive to organisms with complex nervous systems is increasingly being questioned, as emerging evidence from simpler life forms suggests that cognitive-like behaviors existed long before the evolution of complex neural architectures.\n\nThe tension between traditional views of cognition and emerging evidence from simpler organisms highlights the need for a broader understanding of cognitive capacities across species. As we shift our focus from complex organisms to simpler model systems, it becomes evident that our understanding of cognition must evolve. This shift not only challenges established paradigms but also underscores the importance of a biological perspective in redefining cognition beyond human-centric models. The implications of this are far-reaching; they suggest that our current frameworks for understanding cognition may be overly restrictive and in need of significant revision.\n\nUltimately, the exploration of cognition's evolution invites us to confront several implicit assumptions that have long governed our understanding of mental processes. The belief that cognition is a complex phenomenon that cannot be fully understood through traditional cognitive science frameworks is one such assumption. Additionally, the view that human cognition serves as the benchmark for all cognitive processes is limiting and needs to be expanded to include a broader biological perspective. As we grapple with these challenges, it becomes clear that the evolution of cognition is not merely a story of complexity but rather a rich tapestry of gradual development that spans across diverse life forms.\n\nIn conclusion, the exploration of cognition's evolution reveals a landscape fraught with ambiguity and complexity. The interplay between simpler organisms and traditional cognitive paradigms invites a reconsideration of what it means to think and to be aware. As we continue to uncover the cognitive capacities of simpler life forms, we must remain vigilant against the tendency to impose human-centric frameworks on our understanding of cognition. The journey toward a more inclusive understanding of cognitive evolution is ongoing, and it is one that promises to reshape our perceptions of intelligence and awareness across the biological spectrum.",
      "word_count": 761,
      "genre": "Neuroscience",
      "difficulty": "hard",
      "source": "aeon.co",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "is_daily_pick": false,
      "is_featured": false,
      "is_archived": false,
      "created_at": "2026-01-19T20:16:06.962Z",
      "updated_at": "2026-01-19T20:16:06.962Z"
    },
    {
      "id": "f12d6748-3a7e-464a-9102-37a8b67d08fe",
      "title": "Passage 2",
      "content": "The evolution of Russian nationalism within the Soviet framework reveals a complex interplay between historical narratives, cultural expressions, and political ambitions. Historically, Russian nationalism has been both suppressed and co-opted by Soviet leadership, leading to a multifaceted relationship between Russian identity and Soviet ideology. Lenin's approach to national identity emphasized the need for unity among various ethnic groups within the Soviet Union, advocating for a form of nationalism that aligned with socialist principles. In contrast, Stalin's policies often sought to centralize power and promote a singular Soviet identity, which marginalized distinct national identities. This tension between the promotion of a unified Soviet identity and the underlying currents of Russian nationalism set the stage for future conflicts and contradictions.\n\nThe late 20th century marked a resurgence of nationalist sentiments that had been previously stifled. Gorbachev's reforms, particularly the policies of glasnost and perestroika, inadvertently catalyzed nationalist movements across the Soviet republics. These reforms created a political environment that allowed for the expression of long-suppressed national identities, leading to a reevaluation of Russia's role within the Soviet Union. The emergence of cultural figures, such as the 'village prose' writers, played a significant role in articulating a vision of Russian identity that resonated with popular sentiments. These writers challenged Soviet orthodoxy, reflecting broader societal anxieties and aspirations during a time of political upheaval. Their works not only highlighted the complexities of Russian identity but also served as a catalyst for political movements seeking greater autonomy.\n\nHowever, the dissolution of the Soviet Union in 1991 was not solely a product of Russian nationalism; it was influenced by a combination of secessionist aspirations from various republics and the broader socio-political landscape. The narrative that positions Russian nationalism as the singular driving force behind the Soviet collapse is, at best, an oversimplification. While Russian nationalism undeniably played a role, the aspirations of other republics for sovereignty and independence complicate this narrative. The interplay between Russian secessionism and the desires of other ethnic groups illustrates the multifaceted nature of nationalism within the Soviet context.\n\nIn the post-Soviet period, Russian nationalism has evolved into a phenomenon characterized by a blend of nostalgia for imperial greatness and a desire for a distinct national identity. This duality often manifests in political strategies employed by leaders such as Boris Yeltsin and Vladimir Putin, who have navigated the complexities of national identity in a rapidly changing socio-political landscape. Yeltsin's early presidency was marked by a push for democratic reforms and a reassertion of Russian sovereignty, yet it also faced significant challenges from nationalist movements that sought to redefine what it meant to be Russian in a post-imperial context. Conversely, Putin's administration has increasingly embraced a narrative of Russian exceptionalism, often invoking historical grievances and imperial nostalgia to consolidate power and foster national unity.\n\nCultural representations of Russian identity, particularly through literature and film, further reflect and shape public perceptions of nationalism. These representations serve as a mirror to societal anxieties, revealing the tensions between historical grievances and contemporary aspirations. The portrayal of Russian identity in popular culture has transformed in response to socio-economic changes and political narratives, often oscillating between a celebration of national pride and a critique of past injustices. This dynamic underscores the notion that national identity is not static; rather, it is continually negotiated and redefined in light of historical context and current realities.\n\nYet, the implications of contemporary Russian nationalism remain ambiguous. The extent to which it is a reaction to historical grievances versus a genuine aspiration for national renewal is unresolved. Furthermore, the differing approaches to nationalism by leaders like Yeltsin and Putin reflect broader societal attitudes towards Russia's past and future. While Yeltsin's tenure was marked by a struggle to forge a new national identity amidst the chaos of transition, Putin's administration has sought to reestablish a sense of stability and continuity, albeit through a lens that often romanticizes the imperial past.\n\nIn conclusion, the evolution of Russian nationalism is a complex narrative that intertwines historical context, cultural expressions, and political strategies. The interplay between Russian identity and Soviet ideology has shaped the trajectory of nationalism in Russia, revealing both the aspirations and anxieties of a society grappling with its past. As the discourse around Russian identity continues to evolve, the unresolved tensions between historical grievances and contemporary aspirations will likely persist, inviting further exploration and debate.",
      "word_count": 721,
      "genre": "Urban Studies",
      "difficulty": "hard",
      "source": "aeon.co",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "is_daily_pick": false,
      "is_featured": false,
      "is_archived": false,
      "created_at": "2026-01-19T20:16:27.209Z",
      "updated_at": "2026-01-19T20:16:27.209Z"
    },
    {
      "id": "075a17bb-35eb-46f3-9b82-a4d26e104a3a",
      "title": "Passage 3",
      "content": "The political dichotomy between landholders and stockholders has deep historical roots, tracing back to the seating arrangements of the French Revolution, where the Left and Right emerged as representatives of distinct social classes. This division, however, is not merely a relic of the past; it continues to shape contemporary political alignments and economic structures. The Left, traditionally associated with the advocacy for workers' rights and material wealth, often finds itself in a paradoxical position. Regions that lean Left can exhibit economic prosperity while simultaneously espousing anti-capitalist sentiments. This contradiction raises questions about the coherence of political ideologies and their alignment with economic realities. \n\nDavid Hume's analysis of debt financing provides a critical lens through which to examine these tensions. Hume expressed concerns about the implications of debt on social structures, suggesting that financial independence could lead to the erosion of traditional familial and community ties. As individuals become detached from land-based responsibilities, the potential for social disintegration increases. This perspective invites a reevaluation of the relationship between economic practices and social responsibility, particularly in an age where financialization dominates. The rise of a financialized economy necessitates a constant influx of borrowers, complicating traditional class analyses and suggesting that social mobility is not merely desirable but essential for economic stability. \n\nInflation, too, plays a pivotal role in shaping economic practices and social dynamics. Historically, inflation has influenced production and trade, creating conditions that compel individuals to seek upward mobility. However, this drive for mobility can pose risks to traditional familial structures and cultural continuity, as individuals prioritize personal advancement over communal ties. The overlap between landholder and stockholder economies further complicates these dynamics; while each group maintains distinct interests, their interactions can lead to conflict and confusion within political alignments. \n\nThe ongoing tension between these two economic paradigms raises critical questions about the future of political dynamics. As the stockholder economy continues to gain prominence, the coexistence of traditional landholding values becomes increasingly tenuous. The implications of climate change add another layer of complexity, as resource conflicts may exacerbate existing divisions. The assumption that economic prosperity can be decoupled from social responsibility is increasingly challenged, suggesting that a more nuanced understanding of political alignments is necessary. \n\nMoreover, the relationship between economic behavior and political identity is fraught with ambiguity. It is insufficient to attribute voting patterns solely to economic class; cultural and familial values also play a significant role in shaping political identities. The evolution of economic systems, influenced by historical patterns of debt and inflation, has lasting effects on social structures and political alignments. This interplay invites further exploration into how these dynamics manifest in contemporary society, particularly as marginalized groups seek greater involvement in economic practices. \n\nAs we consider the implications of these historical and contemporary tensions, it becomes evident that the political spectrum cannot be neatly categorized. The complexities of class interests, social mobility, and economic practices demand a critical examination of the assumptions that underpin our understanding of political behavior. The notion that individuals act solely in their material interests is increasingly challenged by the realities of cultural and familial influences. \n\nIn this context, the role of debt financing emerges as a double-edged sword; while it can facilitate economic participation, it also risks fostering individualism at the expense of social responsibility. The financialized economy, characterized by its reliance on borrowers, complicates traditional class analyses and suggests that the dynamics of social mobility are more intricate than previously understood. \n\nUltimately, the distinct yet overlapping economies of landholders and stockholders continue to shape contemporary politics, revealing the inherent tensions between individual liberty and social responsibility. As these two paradigms interact, the potential for conflict remains ever-present, challenging the notion that economic prosperity can exist independently of social cohesion. The unresolved nature of these tensions invites further inquiry into the future of political alignments and the role of economic practices in shaping societal values. \n\nThus, the historical origins of the political spectrum, coupled with the evolving dynamics of debt financing and inflation, underscore the complexity of contemporary political and economic landscapes. The implications of these developments extend beyond mere academic discourse; they resonate with the lived experiences of individuals navigating an increasingly financialized world. As we grapple with these realities, the need for a more nuanced understanding of the interplay between economic practices and social structures becomes imperative, leaving us to ponder the future of political alignments in an era marked by profound change.",
      "word_count": 734,
      "genre": "Economics",
      "difficulty": "hard",
      "source": "aeon.co",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "is_daily_pick": false,
      "is_featured": false,
      "is_archived": false,
      "created_at": "2026-01-19T20:17:03.634Z",
      "updated_at": "2026-01-19T20:17:03.634Z"
    },
    {
      "id": "8878655e-1095-4638-a5c2-04ea6ae448dd",
      "title": "Passage 4",
      "content": "Christian Wolff's philosophical contributions, particularly during the Enlightenment, present a complex interplay between mathematics and systematic thought. His early exposure to Cartesian philosophy and mathematics significantly shaped his approach, leading to the development of what is now termed Wolffianism. This philosophical system sought to organize knowledge through a mathematical method, emphasizing clarity and deductive reasoning. Such an approach not only aimed to establish a rigorous framework for philosophical inquiry but also aligned with the broader Enlightenment ideals that championed reason as a means to reduce conflict and enhance understanding. However, the very clarity that Wolff sought to achieve also became a point of contention, particularly in his interactions with the theological faculty at Halle, where his ideas were met with resistance.\n\nWolff's decision to write in German rather than the traditional Latin was a pivotal move that democratized philosophy, making it accessible to a broader audience, including women. This choice facilitated the establishment of a stable philosophical vocabulary, which was essential for precise discourse in a field often dominated by elite scholars. Yet, this democratization also invited criticism; some contemporaries viewed his efforts as a dilution of philosophical rigor. The backlash from the theological community illustrates the tensions inherent in the Enlightenment period, where emerging philosophical ideas frequently clashed with established religious doctrines. Wolff's eventual expulsion from Prussia not only marked a significant turning point in his career but also transformed him into a martyr for Enlightenment thought—a narrative that ironically enhanced his reputation across Europe.\n\nDespite his initial popularity and the foundational role he played in shaping modern philosophy, Wolff's influence began to wane in the late 18th and early 19th centuries. The rise of Kantian and Idealist philosophies overshadowed his contributions, leading to a perception of Wolff as merely a follower of Leibniz. This characterization is problematic; it simplifies the nuanced relationship between Wolff's work and that of his predecessors and contemporaries. The assumption that Wolff's philosophy lacks originality fails to account for the substantive innovations he introduced, particularly in the systematic organization of knowledge. Furthermore, the neglect of Wolff's contributions in contemporary philosophical discourse obscures critical aspects of German intellectual history, including the influence he had on women philosophers of his time.\n\nThe decline of Wolff's philosophical stature raises questions about the dynamics of intellectual legacy and the criteria by which philosophical significance is measured. The prevailing narrative often favors dominant figures, leading to the marginalization of those who contributed significantly to the field. This tendency is particularly evident in the case of Wolff, whose systematic approach and efforts to popularize philosophy have been overshadowed by later thinkers. The implications of this marginalization extend beyond historical interest; they challenge the very foundations of how philosophical discourse is constructed and who is deemed worthy of recognition. \n\nMoreover, the interplay between Wolff's mathematical method and Enlightenment ideals invites further scrutiny. While his method embodies the Enlightenment's faith in reason, it also raises questions about the inherent limitations of such an approach. The assumption that clarity and systematic thinking can lead to greater societal harmony is, at best, tenuous. The complexities of human experience often resist reduction to mathematical formulations, suggesting that a more nuanced understanding of philosophical inquiry is necessary. This complexity is further compounded by the historical context in which Wolff operated, where the boundaries between philosophy and theology were not only blurred but often contentious.\n\nIn light of these considerations, the legacy of Wolff invites a reevaluation of the philosophical canon. The neglect of his work in contemporary discussions not only diminishes our understanding of the Enlightenment but also obscures the contributions of women intellectuals influenced by his ideas. The historical narrative surrounding Wolff's expulsion and subsequent martyrdom serves as a reminder of the intricate relationship between political power and intellectual freedom. It prompts a critical examination of how philosophical ideas are disseminated and the factors that contribute to their acceptance or rejection.\n\nUltimately, Wolff's story is emblematic of the broader tensions within the philosophical tradition—tensions that continue to resonate today. The challenge remains to reconcile the systematic rigor that Wolff championed with the rich, often chaotic realities of human thought and experience. As we navigate these complexities, it becomes increasingly clear that the legacy of figures like Wolff is not merely a historical footnote but a vital component of our ongoing philosophical discourse. The unresolved tensions surrounding his contributions compel us to reconsider the narratives we construct about intellectual history and the figures we choose to elevate within it.",
      "word_count": 743,
      "genre": "Philosophy",
      "difficulty": "hard",
      "source": "aeon.co",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "is_daily_pick": false,
      "is_featured": false,
      "is_archived": false,
      "created_at": "2026-01-19T20:17:20.717Z",
      "updated_at": "2026-01-19T20:17:20.717Z"
    }
  ],
  "questions": [
    {
      "id": "1eae83e3-a137-4179-b585-18c2f249e7d3",
      "passage_id": "cd52c937-2c92-4a29-8630-71ee516d67a2",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "What can be inferred about the implications of recognizing cognitive capacities in simpler organisms for the field of cognitive neuroscience?",
      "question_type": "rc_question",
      "options": {
        "A": "It may lead to a reevaluation of the functional units of the brain based on human-centric models.",
        "B": "It suggests that the study of cognition should focus solely on complex organisms.",
        "C": "It indicates that cognitive neuroscience must expand its frameworks to include a broader range of cognitive expressions.",
        "D": "It implies that cognitive capacities are exclusively linked to complex neural architectures."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "C"
      },
      "rationale": "The correct option is C) It indicates that cognitive neuroscience must expand its frameworks to include a broader range of cognitive expressions. The passage states: 'the assumption that higher cognitive functions are exclusive to organisms with complex nervous systems is increasingly being questioned, as emerging evidence from simpler life forms suggests that cognitive-like behaviors existed long before the evolution of complex neural architectures.' This supports the idea that cognitive neuroscience needs to broaden its frameworks. \n\nOption A is tempting as it suggests a reevaluation of brain functions. However, the passage says: 'the relationship between neural structures and cognitive capacities remains ambiguous,' which contradicts this. \n\nOption D is also misleading because it implies that cognitive capacities are only linked to complex organisms. The passage states: 'cognitive traits are not unique to humans but are present in various forms throughout the tree of life,' which directly contradicts this notion.",
      "difficulty": "hard",
      "tags": [
        "inference_accuracy",
        "evidence_evaluation"
      ],
      "created_at": "2026-01-19T20:17:59.846Z",
      "updated_at": "2026-01-19T20:22:07.986Z"
    },
    {
      "id": "cbc6939f-969e-41e4-97fe-40646c9dd1cf",
      "passage_id": "cd52c937-2c92-4a29-8630-71ee516d67a2",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "What is the author's primary purpose in discussing the cognitive capacities of simpler organisms?",
      "question_type": "rc_question",
      "options": {
        "A": "To argue that traditional cognitive science frameworks are sufficient for understanding cognition.",
        "B": "To highlight the need for a more inclusive understanding of cognitive evolution across species.",
        "C": "To suggest that cognitive capacities are unique to complex organisms.",
        "D": "To emphasize the superiority of human cognition over that of simpler organisms."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct option is B) To highlight the need for a more inclusive understanding of cognitive evolution across species. The passage emphasizes: 'the evolution of cognition is not merely a story of complexity but rather a rich tapestry of gradual development that spans across diverse life forms.' This indicates the author's purpose of advocating for a broader understanding of cognition. \n\nOption A is tempting because it suggests traditional frameworks are sufficient. However, the passage states: 'the prevailing view that cognition is a hallmark of higher animals is not only misleading but also insufficient,' which contradicts this. \n\nOption C suggests that cognitive capacities are unique to complex organisms, which is incorrect as the passage argues against this by stating: 'cognitive traits are not unique to humans.' Thus, it does not align with the author's intent.",
      "difficulty": "medium",
      "tags": [
        "inference_accuracy",
        "argument_structure_analysis"
      ],
      "created_at": "2026-01-19T20:17:59.846Z",
      "updated_at": "2026-01-19T20:22:07.986Z"
    },
    {
      "id": "9cbc2f9d-6396-49a5-8fe0-22d098e7cd80",
      "passage_id": "cd52c937-2c92-4a29-8630-71ee516d67a2",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "Which of the following statements is supported by the passage regarding the traditional view of cognition?",
      "question_type": "rc_question",
      "options": {
        "A": "Cognition is solely a product of environmental interactions.",
        "B": "Cognition is viewed as a reactive mechanism responding to stimuli.",
        "C": "Cognition is an exclusive trait of higher animals.",
        "D": "Cognition has no connection to simpler organisms."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct option is B) Cognition is viewed as a reactive mechanism responding to stimuli. The passage states: 'Traditionally, cognition has been viewed as a reactive mechanism, responding to external stimuli.' This directly supports the option. \n\nOption A is tempting as it suggests cognition is solely a product of environmental interactions. However, the passage indicates: 'the discovery of spontaneous brain activity suggests that cognitive processes may involve ongoing internal dynamics,' which contradicts this. \n\nOption C is misleading because it implies cognition is exclusive to higher animals. The passage argues: 'the assumption that higher cognitive functions are exclusive to organisms with complex nervous systems is increasingly being questioned,' which directly counters this idea.",
      "difficulty": "easy",
      "tags": [
        "inference_accuracy",
        "detail_vs_structure_balance"
      ],
      "created_at": "2026-01-19T20:17:59.846Z",
      "updated_at": "2026-01-19T20:22:07.986Z"
    },
    {
      "id": "50130590-3210-4474-b2d4-56f2b88b4775",
      "passage_id": "cd52c937-2c92-4a29-8630-71ee516d67a2",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "Which of the following best captures the main idea of the passage?",
      "question_type": "rc_question",
      "options": {
        "A": "Cognition is a complex phenomenon unique to mammals.",
        "B": "Cognitive evolution is a gradual process that includes both complex and simpler organisms.",
        "C": "Cognitive capacities are best understood through a human-centric lens.",
        "D": "The study of cognition should focus exclusively on advanced organisms."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct option is B) Cognitive evolution is a gradual process that includes both complex and simpler organisms. The passage states: 'the evolution of cognition is not merely a story of complexity but rather a rich tapestry of gradual development that spans across diverse life forms.' This clearly captures the main idea. \n\nOption A is tempting as it suggests cognition is unique to mammals. However, the passage argues: 'cognitive traits are not unique to humans but are present in various forms throughout the tree of life,' which contradicts this. \n\nOption C is misleading because it suggests a human-centric view. The passage emphasizes: 'our current frameworks for understanding cognition may be overly restrictive and in need of significant revision,' which counters this notion. \n\nOption D is also incorrect as it implies an exclusive focus on advanced organisms, which the passage does not support.",
      "difficulty": "medium",
      "tags": [
        "inference_accuracy",
        "detail_vs_structure_balance"
      ],
      "created_at": "2026-01-19T20:17:59.846Z",
      "updated_at": "2026-01-19T20:22:07.986Z"
    },
    {
      "id": "c9a6d81c-143b-4c25-ba8f-226b83887570",
      "passage_id": "f12d6748-3a7e-464a-9102-37a8b67d08fe",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "Which of the following can be inferred about the relationship between Russian nationalism and Soviet ideology during the late 20th century?",
      "question_type": "rc_question",
      "options": {
        "A": "The resurgence of Russian nationalism was solely due to the policies of Gorbachev.",
        "B": "Nationalist movements were catalyzed by a combination of Gorbachev's reforms and historical suppression.",
        "C": "The Soviet leadership fully embraced Russian nationalism as a unifying force.",
        "D": "Cultural figures played no significant role in the expression of Russian identity."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct answer is B) Nationalist movements were catalyzed by a combination of Gorbachev's reforms and historical suppression. The passage states: 'Gorbachev's reforms, particularly the policies of glasnost and perestroika, inadvertently catalyzed nationalist movements across the Soviet republics.' This indicates that Gorbachev's policies played a significant role in the resurgence of nationalism, alongside the historical suppression of these sentiments. Option A is tempting because it suggests a direct cause, but it oversimplifies the situation. The passage clarifies that the resurgence was not solely due to Gorbachev's policies, as it also mentions 'long-suppressed national identities.' Therefore, this contradicts the idea that Gorbachev alone was responsible. Option C is misleading as it implies that Soviet leadership fully embraced Russian nationalism, whereas the passage describes a complex relationship where nationalism was often suppressed. The passage states: 'Russian nationalism has been both suppressed and co-opted by Soviet leadership,' which directly contradicts this option.",
      "difficulty": "hard",
      "tags": [
        "inference_accuracy",
        "trap_avoidance_rate"
      ],
      "created_at": "2026-01-19T20:18:26.104Z",
      "updated_at": "2026-01-19T20:22:35.428Z"
    },
    {
      "id": "a58bc261-c707-4645-9f82-54ba0ad122fe",
      "passage_id": "f12d6748-3a7e-464a-9102-37a8b67d08fe",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "What is the author's tone towards the evolution of Russian nationalism in the context of Soviet history?",
      "question_type": "rc_question",
      "options": {
        "A": "Critical of the oversimplification of Russian nationalism's role in the Soviet collapse.",
        "B": "Celebratory of the resurgence of Russian nationalism in the post-Soviet era.",
        "C": "Neutral regarding the complexities of Russian identity.",
        "D": "Dismissive of the cultural expressions of Russian nationalism."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "A"
      },
      "rationale": "The correct answer is A) Critical of the oversimplification of Russian nationalism's role in the Soviet collapse. The passage states: 'The narrative that positions Russian nationalism as the singular driving force behind the Soviet collapse is, at best, an oversimplification.' This clearly indicates the author's critical stance towards simplistic interpretations of Russian nationalism's influence. Option B is tempting as it suggests a celebratory tone, but the passage does not express celebration; rather, it critiques the oversimplification. Option C is misleading because the author does not maintain a neutral tone; instead, they express skepticism about simplistic narratives. The passage emphasizes the complexities involved, stating: 'the aspirations of other republics for sovereignty and independence complicate this narrative,' which shows a nuanced view rather than neutrality.",
      "difficulty": "medium",
      "tags": [
        "tone_and_intent_sensitivity",
        "evidence_evaluation"
      ],
      "created_at": "2026-01-19T20:18:26.104Z",
      "updated_at": "2026-01-19T20:22:35.428Z"
    },
    {
      "id": "6d8e83fd-b4cc-4abc-87a1-3ba351cdcbf2",
      "passage_id": "f12d6748-3a7e-464a-9102-37a8b67d08fe",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "According to the passage, which of the following statements is true regarding the portrayal of Russian identity in popular culture?",
      "question_type": "rc_question",
      "options": {
        "A": "It has remained static and unchanging over time.",
        "B": "It reflects societal anxieties and aspirations related to historical grievances.",
        "C": "It is solely focused on celebrating national pride without critique.",
        "D": "It has no connection to the political narratives of contemporary Russia."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct answer is B) It reflects societal anxieties and aspirations related to historical grievances. The passage states: 'Cultural representations of Russian identity... serve as a mirror to societal anxieties, revealing the tensions between historical grievances and contemporary aspirations.' This indicates that popular culture does indeed reflect these complexities. Option A is tempting as it suggests that portrayal is static, but the passage explicitly states that 'national identity is not static; rather, it is continually negotiated and redefined.' This directly contradicts the idea of a static portrayal. Option C is misleading because it implies a lack of critique in cultural representations, while the passage highlights that these representations oscillate 'between a celebration of national pride and a critique of past injustices.' This shows that there is indeed critique present.",
      "difficulty": "easy",
      "tags": [
        "inference_accuracy",
        "tone_and_intent_sensitivity"
      ],
      "created_at": "2026-01-19T20:18:26.104Z",
      "updated_at": "2026-01-19T20:22:35.428Z"
    },
    {
      "id": "1c4b0e63-c3dc-49cc-9f28-f0ff7b0b9cbc",
      "passage_id": "f12d6748-3a7e-464a-9102-37a8b67d08fe",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "The author suggests that the narrative positioning Russian nationalism as the sole cause of the Soviet Union's dissolution is:",
      "question_type": "rc_question",
      "options": {
        "A": "A nuanced understanding of the complexities involved.",
        "B": "An oversimplification that ignores other contributing factors.",
        "C": "A widely accepted historical interpretation.",
        "D": "A perspective that has been thoroughly discredited."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct answer is B) An oversimplification that ignores other contributing factors. The passage states: 'The narrative that positions Russian nationalism as the singular driving force behind the Soviet collapse is, at best, an oversimplification.' This clearly supports the idea that the author views this narrative as too simplistic. Option A is tempting as it suggests a nuanced understanding, but the passage explicitly critiques the oversimplification rather than endorsing a nuanced view. Option C is misleading because it implies that this narrative is widely accepted, while the passage critiques it, indicating that it is not a universally accepted interpretation. The author emphasizes that 'the interplay between Russian secessionism and the desires of other ethnic groups illustrates the multifaceted nature of nationalism,' which contradicts the notion of a singular cause.",
      "difficulty": "medium",
      "tags": [
        "inference_accuracy",
        "argument_structure_analysis"
      ],
      "created_at": "2026-01-19T20:18:26.104Z",
      "updated_at": "2026-01-19T20:22:35.428Z"
    },
    {
      "id": "679ef5e9-6b16-4b3b-bfa5-7e9c997754c3",
      "passage_id": "075a17bb-35eb-46f3-9b82-a4d26e104a3a",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "What can be inferred about the author's perspective on the relationship between debt financing and social responsibility?",
      "question_type": "rc_question",
      "options": {
        "A": "Debt financing is solely beneficial for economic participation without any social implications.",
        "B": "The author believes that debt financing fosters individualism, which undermines social cohesion.",
        "C": "The author suggests that debt financing enhances traditional familial structures.",
        "D": "Debt financing is viewed by the author as a necessary evil that promotes social responsibility."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct option is B) The author believes that debt financing fosters individualism, which undermines social cohesion. The passage states: 'the role of debt financing emerges as a double-edged sword; while it can facilitate economic participation, it also risks fostering individualism at the expense of social responsibility.' This indicates that the author sees a negative impact of debt on social ties. Option A is tempting because it suggests a clear benefit of debt financing, but it gets it wrong by ignoring the social implications mentioned in the passage. However, the passage says: 'the potential for social disintegration increases' which contradicts this. Option C is misleading as it implies that debt financing enhances traditional familial structures, but the passage highlights the opposite effect: 'individuals become detached from land-based responsibilities.' Therefore, the correct choice is B.",
      "difficulty": "hard",
      "tags": [
        "inference_accuracy",
        "tone_and_intent_sensitivity"
      ],
      "created_at": "2026-01-19T20:18:54.542Z",
      "updated_at": "2026-01-19T20:22:55.753Z"
    },
    {
      "id": "6a1bf7b0-0306-4fd6-ba16-b83abd68bf6b",
      "passage_id": "075a17bb-35eb-46f3-9b82-a4d26e104a3a",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "Which of the following best captures the author's tone towards the political dichotomy discussed in the passage?",
      "question_type": "rc_question",
      "options": {
        "A": "Optimistic about the potential for resolution between landholders and stockholders.",
        "B": "Critical of the simplistic categorization of political ideologies.",
        "C": "Indifferent to the historical roots of political alignments.",
        "D": "Supportive of the traditional views held by both landholders and stockholders."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct option is B) Critical of the simplistic categorization of political ideologies. The passage discusses the complexities of political alignments, stating: 'the political spectrum cannot be neatly categorized.' This indicates a critical stance towards oversimplified views. Option A is tempting as it suggests optimism, but the passage does not express hope for resolution; instead, it highlights ongoing tensions. Option C is incorrect because the passage does not show indifference; it emphasizes the historical roots and their implications. Therefore, the correct choice is B.",
      "difficulty": "medium",
      "tags": [
        "tone_and_intent_sensitivity",
        "argument_structure_analysis"
      ],
      "created_at": "2026-01-19T20:18:54.542Z",
      "updated_at": "2026-01-19T20:22:55.753Z"
    },
    {
      "id": "cdc5c4b1-f37e-4659-b5f6-de376cd7c4a6",
      "passage_id": "075a17bb-35eb-46f3-9b82-a4d26e104a3a",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "According to the passage, which of the following statements is true regarding inflation's impact on social dynamics?",
      "question_type": "rc_question",
      "options": {
        "A": "Inflation has historically led to a decrease in social mobility.",
        "B": "Inflation compels individuals to prioritize communal ties over personal advancement.",
        "C": "Inflation can drive individuals to seek upward mobility, impacting traditional familial structures.",
        "D": "Inflation is irrelevant to the relationship between economic practices and social responsibility."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "C"
      },
      "rationale": "The correct option is C) Inflation can drive individuals to seek upward mobility, impacting traditional familial structures. The passage states: 'inflation has influenced production and trade, creating conditions that compel individuals to seek upward mobility.' This indicates a direct link between inflation and the pursuit of personal advancement. Option A is tempting as it suggests a negative impact of inflation, but it gets it wrong because the passage does not claim that inflation decreases social mobility. Instead, it shows that inflation drives mobility. Option B misinterprets the passage by suggesting inflation encourages communal ties, while the passage indicates that personal advancement often takes precedence over communal ties. Hence, the correct answer is C.",
      "difficulty": "easy",
      "tags": [
        "inference_accuracy",
        "evidence_evaluation"
      ],
      "created_at": "2026-01-19T20:18:54.542Z",
      "updated_at": "2026-01-19T20:22:55.753Z"
    },
    {
      "id": "30e97108-6e90-4567-b9e6-ebd4864a7ecb",
      "passage_id": "075a17bb-35eb-46f3-9b82-a4d26e104a3a",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "What is the main implication of the author's discussion on the evolving dynamics of landholder and stockholder economies?",
      "question_type": "rc_question",
      "options": {
        "A": "Economic prosperity can be achieved without considering social responsibility.",
        "B": "The coexistence of these economies is essential for political stability.",
        "C": "The complexities of these economies challenge traditional political alignments.",
        "D": "Landholders will inevitably lose their influence in the political sphere."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "C"
      },
      "rationale": "The correct option is C) The complexities of these economies challenge traditional political alignments. The passage states: 'the distinct yet overlapping economies of landholders and stockholders continue to shape contemporary politics, revealing the inherent tensions between individual liberty and social responsibility.' This suggests that these complexities complicate political alignments. Option A is tempting as it implies a separation of economics from social responsibility, but the passage argues against this by stating: 'the assumption that economic prosperity can be decoupled from social responsibility is increasingly challenged.' Option B is incorrect as it implies a necessity for coexistence, which the passage does not assert. Thus, the correct choice is C.",
      "difficulty": "medium",
      "tags": [
        "inference_accuracy",
        "argument_structure_analysis"
      ],
      "created_at": "2026-01-19T20:18:54.542Z",
      "updated_at": "2026-01-19T20:22:55.753Z"
    },
    {
      "id": "482015ec-9fa7-41de-9bb2-456a6ec84e20",
      "passage_id": "8878655e-1095-4638-a5c2-04ea6ae448dd",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "Which of the following can be inferred about Wolff's decision to write in German instead of Latin?",
      "question_type": "rc_question",
      "options": {
        "A": "It was primarily a strategic move to gain favor with the elite scholars of his time.",
        "B": "This choice aimed to make philosophy more accessible and challenge the existing academic hierarchy.",
        "C": "Wolff believed that writing in German would enhance the rigor of philosophical discourse.",
        "D": "His decision was met with unanimous approval from the philosophical community."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct option is B) This choice aimed to make philosophy more accessible and challenge the existing academic hierarchy. The passage states: 'Wolff's decision to write in German rather than the traditional Latin was a pivotal move that democratized philosophy, making it accessible to a broader audience.' This indicates that his choice was intended to challenge the elitism of academic discourse. Option A is tempting because it suggests a strategic move, but it gets wrong the intent behind Wolff's decision. The passage emphasizes his aim for accessibility rather than gaining favor: 'This choice facilitated the establishment of a stable philosophical vocabulary.' Option C is misleading as it implies Wolff believed writing in German would enhance rigor, but the passage does not support this; it states: 'some contemporaries viewed his efforts as a dilution of philosophical rigor.' Lastly, Option D is incorrect because it suggests unanimous approval, while the passage notes resistance: 'his ideas were met with resistance.'",
      "difficulty": "hard",
      "tags": [
        "inference_accuracy",
        "argument_structure_analysis"
      ],
      "created_at": "2026-01-19T20:19:24.667Z",
      "updated_at": "2026-01-19T20:23:17.899Z"
    },
    {
      "id": "e3450b9c-4ebf-48a9-a083-dee5430b6e4b",
      "passage_id": "8878655e-1095-4638-a5c2-04ea6ae448dd",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "What is the primary tone of the author when discussing Wolff's expulsion from Prussia?",
      "question_type": "rc_question",
      "options": {
        "A": "Indifferent",
        "B": "Critical",
        "C": "Sympathetic",
        "D": "Celebratory"
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "C"
      },
      "rationale": "The correct answer is C) Sympathetic. The author discusses Wolff's expulsion and martyrdom in a way that highlights the injustices he faced, stating: 'Wolff's eventual expulsion from Prussia not only marked a significant turning point in his career but also transformed him into a martyr for Enlightenment thought.' This indicates a sympathetic tone towards Wolff's plight. Option A is tempting as it suggests indifference, but the passage conveys a clear emotional response to Wolff's situation. The phrase 'transformed him into a martyr' implies a deeper significance rather than indifference. Option B is incorrect as it suggests a critical tone, while the passage reflects admiration for Wolff's contributions despite the challenges he faced. The author notes: 'his reputation across Europe' was enhanced, indicating a positive view. Lastly, Option D is dismissed as celebratory, which misrepresents the tone; the author reflects on the struggles rather than celebrating them.",
      "difficulty": "medium",
      "tags": [
        "tone_and_intent_sensitivity",
        "evidence_evaluation"
      ],
      "created_at": "2026-01-19T20:19:24.667Z",
      "updated_at": "2026-01-19T20:23:17.899Z"
    },
    {
      "id": "d4909eeb-0e6c-46b6-aaeb-c314718ebf4b",
      "passage_id": "8878655e-1095-4638-a5c2-04ea6ae448dd",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "According to the passage, which of the following statements accurately reflects Wolff's contributions to philosophy?",
      "question_type": "rc_question",
      "options": {
        "A": "Wolff's work is often viewed as lacking originality compared to Kantian philosophies.",
        "B": "Wolff's systematic approach was universally accepted by his contemporaries.",
        "C": "Wolff's ideas were primarily focused on theological discussions.",
        "D": "Wolff's contributions have been consistently recognized in contemporary philosophical discourse."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "A"
      },
      "rationale": "The correct answer is A) Wolff's work is often viewed as lacking originality compared to Kantian philosophies. The passage states: 'the rise of Kantian and Idealist philosophies overshadowed his contributions, leading to a perception of Wolff as merely a follower of Leibniz.' This indicates that his contributions are often seen as derivative. Option B is tempting because it suggests universal acceptance, but the passage notes resistance to his ideas: 'his ideas were met with resistance.' This contradicts the notion of universal acceptance. Option C is incorrect as it implies Wolff's focus was solely on theology, while the passage emphasizes his systematic approach to philosophy: 'Wolff's systematic approach was universally accepted by his contemporaries.' Option D is also wrong; the passage indicates neglect of Wolff's contributions in contemporary discourse, stating: 'the neglect of Wolff's contributions in contemporary philosophical discourse obscures critical aspects of German intellectual history.'",
      "difficulty": "easy",
      "tags": [
        "inference_accuracy",
        "evidence_evaluation"
      ],
      "created_at": "2026-01-19T20:19:24.667Z",
      "updated_at": "2026-01-19T20:23:17.899Z"
    },
    {
      "id": "f851a292-6b97-430f-a6bb-c2ed69129ae8",
      "passage_id": "8878655e-1095-4638-a5c2-04ea6ae448dd",
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "What is the central implication of the author's discussion regarding the marginalization of Wolff's work?",
      "question_type": "rc_question",
      "options": {
        "A": "It suggests that Wolff's systematic approach is irrelevant to modern philosophical discourse.",
        "B": "It highlights the need for a reevaluation of the criteria used to measure philosophical significance.",
        "C": "It indicates that Wolff's contributions were only significant during his lifetime.",
        "D": "It implies that the philosophical canon is solely determined by popular opinion."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "The correct answer is B) It highlights the need for a reevaluation of the criteria used to measure philosophical significance. The passage states: 'The decline of Wolff's philosophical stature raises questions about the dynamics of intellectual legacy and the criteria by which philosophical significance is measured.' This directly supports the implication of the need for reevaluation. Option A is tempting as it suggests irrelevance, but the passage argues for Wolff's importance: 'the neglect of Wolff's contributions... obscures critical aspects of German intellectual history.' Option C is misleading; the passage indicates that Wolff's contributions were significant beyond his lifetime, as seen in the phrase: 'his reputation across Europe.' Lastly, Option D is incorrect as it implies that the philosophical canon is solely determined by popular opinion, while the passage discusses deeper issues regarding legacy and recognition.",
      "difficulty": "medium",
      "tags": [
        "inference_accuracy",
        "evidence_evaluation"
      ],
      "created_at": "2026-01-19T20:19:24.667Z",
      "updated_at": "2026-01-19T20:23:17.899Z"
    },
    {
      "id": "0f84b74a-c149-404a-826f-b1a3ea15a689",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "The passage given below is followed by four alternate summaries. Choose the option that best captures the essence of the passage. \n\nThe evolution of cognition suggests a gradual development that spans millions of years, challenging the traditional view that cognitive abilities are exclusive to higher animals. This perspective emphasizes continuity across species, indicating that cognitive capacities existed long before complex nervous systems emerged. Recent findings from simpler organisms, such as bacteria, reveal cognitive-like behaviors, prompting a reevaluation of how cognition is defined and understood.",
      "question_type": "para_summary",
      "options": {
        "A": "Cognition is a gradual evolutionary process that spans across species, suggesting cognitive capacities are not limited to complex animals.",
        "B": "Cognitive abilities are exclusive to higher animals, with simpler organisms lacking any cognitive-like behaviors.",
        "C": "The evolution of cognition is a sudden emergence that can be traced back to complex nervous systems in higher animals.",
        "D": "Cognition is primarily defined by traditional views that focus on human-centric models of understanding."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "A"
      },
      "rationale": "Option A is correct as it encapsulates the essence of the passage, emphasizing that cognition is a gradual evolutionary process across species. It highlights that cognitive capacities are not exclusive to complex animals, aligning with the passage's argument. Option B is incorrect because it contradicts the passage's claim by asserting that cognitive abilities are exclusive to higher animals. Option C misrepresents the passage by suggesting a sudden emergence of cognition linked to complex nervous systems, which is not supported. Option D is also incorrect as it implies a rigid definition of cognition that the passage challenges.",
      "difficulty": "medium",
      "tags": [
        "inference_accuracy",
        "detail_vs_structure_balance"
      ],
      "created_at": "2026-01-19T20:19:41.953Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    },
    {
      "id": "10597330-d246-4e70-82a8-cd7a874e7b3d",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "The passage given below is followed by four alternate summaries. Choose the option that best captures the essence of the passage. \n\nThe understanding of cognition has evolved significantly, particularly with the recognition that simpler organisms exhibit cognitive-like behaviors. This challenges the traditional cognitivist paradigm, which views cognition as strictly computational. Emerging evidence suggests that cognitive processes may involve spontaneous brain activity, requiring a broader definition that includes various forms of cognitive capacities across different species.",
      "question_type": "para_summary",
      "options": {
        "A": "Cognition is increasingly understood as a computational process, limited to complex organisms with advanced neural structures.",
        "B": "Emerging evidence indicates that cognition encompasses a variety of behaviors across species, including those in simpler organisms.",
        "C": "The evolution of cognition is a linear process that strictly adheres to traditional views of cognitive development.",
        "D": "Cognitive processes are solely reactive and do not involve any internal dynamics or spontaneous activities."
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "B"
      },
      "rationale": "Option B is correct because it accurately reflects the passage's assertion that cognition includes a variety of behaviors across species, particularly in simpler organisms. Option A is misleading as it suggests cognition is limited to complex organisms, which contradicts the passage. Option C incorrectly frames the evolution of cognition as linear and adherent to traditional views, which the passage disputes. Option D is incorrect because it denies the internal dynamics of cognitive processes, which the passage suggests are significant.",
      "difficulty": "hard",
      "tags": [
        "inference_accuracy",
        "detail_vs_structure_balance"
      ],
      "created_at": "2026-01-19T20:19:41.953Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    },
    {
      "id": "bac5b44e-5e98-400f-a3e4-2cdf0016c3b8",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "There is a sentence that is missing in the paragraph below. Look at the paragraph and decide in which blank (option 1, 2, 3, or 4) the following sentence would best fit.\nSentence: The portrayal of Russian identity in literature and media serves as a reflection of societal anxieties and aspirations during times of political upheaval.\nParagraph: ___(1)___. Russian nationalism has deep historical roots that were both suppressed and co-opted by Soviet leadership, leading to a complex relationship between Russian identity and Soviet ideology. ___(2)___. Cultural figures like Shukshin and Solzhenitsyn articulated a vision of Russian identity that challenged Soviet orthodoxy. ___(3)___. The late 20th century saw a resurgence of nationalist sentiments that were initially suppressed but later became politically significant. ___(4)___.",
      "question_type": "para_completion",
      "options": {
        "A": "Option 1",
        "B": "Option 2",
        "C": "Option 3",
        "D": "Option 4"
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "A"
      },
      "rationale": "Option A is the best fit as it introduces the topic of Russian identity, setting the stage for the subsequent discussion about its complexities. The other options do not serve as effective introductions. Option B follows logically from the introduction but does not set the context. Option C and D delve into specific developments without establishing the foundational context needed for understanding the evolution of Russian identity.",
      "difficulty": "medium",
      "tags": [
        "argument_structure_analysis",
        "elimination_effectiveness"
      ],
      "created_at": "2026-01-19T20:20:00.347Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    },
    {
      "id": "edd8834e-0456-4d9b-9809-10349e53f9d9",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "There is a sentence that is missing in the paragraph below. Look at the paragraph and decide in which blank (option 1, 2, 3, or 4) the following sentence would best fit.\nSentence: The complex interplay between historical grievances and contemporary aspirations continues to shape the discourse around Russian identity and nationalism.\nParagraph: ___(1)___. Gorbachev's reforms inadvertently catalyzed nationalist movements, leading to a reevaluation of Russia's role within the Soviet Union and beyond. ___(2)___. Post-Soviet nationalism has evolved into a multifaceted phenomenon, blending nostalgia for the past with contemporary political realities. ___(3)___. The portrayal of Russian identity in popular culture reflects broader societal anxieties and the search for meaning in a rapidly changing political landscape. ___(4)___.",
      "question_type": "para_completion",
      "options": {
        "A": "Option 1",
        "B": "Option 2",
        "C": "Option 3",
        "D": "Option 4"
      },
      "jumbled_sentences": {
        "1": "",
        "2": "",
        "3": "",
        "4": "",
        "5": ""
      },
      "correct_answer": {
        "answer": "C"
      },
      "rationale": "Option C is the best fit as it connects the portrayal of Russian identity in popular culture to broader societal anxieties, which aligns with the paragraph's focus. Option A does not logically connect to the subsequent sentences, while Option B and D, although relevant, do not encapsulate the central theme of societal anxieties and aspirations. Thus, C effectively bridges the ideas presented.",
      "difficulty": "hard",
      "tags": [
        "argument_structure_analysis",
        "elimination_effectiveness"
      ],
      "created_at": "2026-01-19T20:20:00.347Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    },
    {
      "id": "34dce69f-46fa-4ac6-b745-42d1c9b90824",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "The four sentences (labelled 1, 2, 3 and 4) below, when properly sequenced would yield a coherent paragraph. Decide on the proper sequencing of the order of the sentences and key in the sequence of the four numbers as your answer: ",
      "question_type": "para_jumble",
      "options": {
        "A": "",
        "B": "",
        "C": "",
        "D": ""
      },
      "jumbled_sentences": {
        "1": "The overlap between landholder and stockholder economies complicates traditional class analyses, suggesting a more nuanced understanding of political alignments.",
        "2": "David Hume's warnings about debt financing reveal concerns about the erosion of social responsibility and the rise of individualism.",
        "3": "Furthermore, this historical context leads us to consider the implications of modern economic practices.",
        "4": "Social mobility, while desirable, poses risks to traditional familial structures and cultural continuity, impacting political behavior across generations.",
        "5": ""
      },
      "correct_answer": {
        "answer": "1432"
      },
      "rationale": "The anchor is between sentences 1 and 4, as they discuss the overlap of economies and their implications on political alignments. The sequence 1432 is correct because it logically progresses from the complexities of class analyses to the implications of economic practices. The trap lies in sequences that might seem coherent due to shared themes but fail to maintain logical continuity. The golden key is 'Furthermore,' which indicates a continuation of thought from the economic complexities to their implications.",
      "difficulty": "medium",
      "tags": [
        "argument_structure_analysis",
        "trap_avoidance_rate"
      ],
      "created_at": "2026-01-19T20:20:21.192Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    },
    {
      "id": "d337bdfd-d1a8-43c3-b83b-e99bdaad7840",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "The four sentences (labelled 1, 2, 3 and 4) below, when properly sequenced would yield a coherent paragraph. Decide on the proper sequencing of the order of the sentences and key in the sequence of the four numbers as your answer: ",
      "question_type": "para_jumble",
      "options": {
        "A": "",
        "B": "",
        "C": "",
        "D": ""
      },
      "jumbled_sentences": {
        "1": "The political spectrum of Left and Right is historically rooted in class interests, yet contemporary voting patterns often defy simple categorization.",
        "2": "Inflation has historically influenced economic practices, creating incentives for production and trade that shape modern capitalism.",
        "3": "Consequently, the ongoing political divisions reflect deeper economic realities that cannot be ignored.",
        "4": "The distinct yet overlapping economies of landholders and stockholders continue to influence contemporary politics, with each group maintaining unique interests that can lead to conflict.",
        "5": ""
      },
      "correct_answer": {
        "answer": "1423"
      },
      "rationale": "The common thread is the exploration of political and economic dynamics. Option 2 feels like it belongs due to its discussion of inflation, but it diverges from the primary focus on class interests. Option 4 also fits as it discusses the economies of landholders and stockholders. However, option 1 serves as a foundational statement about the political spectrum, making it a necessary part of the group. The misfit factor is the shift from class interests to a broader economic discussion in option 2.",
      "difficulty": "medium",
      "tags": [
        "argument_structure_analysis",
        "trap_avoidance_rate"
      ],
      "created_at": "2026-01-19T20:20:21.192Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    },
    {
      "id": "8a19b10a-ac39-480c-b045-83c27b745640",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "Five jumbled up sentences, related to a topic, are given below. Four of them can be put together to form a coherent paragraph. Identify the odd one out and key in the number of the sentence as your answer: ",
      "question_type": "odd_one_out",
      "options": {
        "A": "",
        "B": "",
        "C": "",
        "D": ""
      },
      "jumbled_sentences": {
        "1": "Wolff's mathematical method emphasized clarity and consistency, which became a hallmark of Enlightenment philosophy.",
        "2": "His decision to write in German rather than Latin significantly contributed to the development of a stable philosophical vocabulary.",
        "3": "The conflict with the theology faculty at Halle highlights the tensions between emerging philosophical ideas and established religious doctrines.",
        "4": "Wolff's expulsion from Prussia turned him into a symbol of Enlightenment thought, enhancing his reputation across Europe.",
        "5": "The perception of Wolff as a mere follower of Leibniz has contributed to his marginalization in the history of philosophy."
      },
      "correct_answer": {
        "answer": "5"
      },
      "rationale": "The common thread is Wolff's contributions to philosophy and the Enlightenment. Option 3 appears relevant as it discusses the rise of Kantian philosophy, but it shifts focus to a specific historical context rather than Wolff's contributions. Options 1, 2, and 4 all relate directly to Wolff's impact and the tensions he faced. The misfit factor is the shift from discussing Wolff's contributions to a broader historical narrative in option 3.",
      "difficulty": "medium",
      "tags": [
        "tone_and_intent_sensitivity",
        "trap_avoidance_rate"
      ],
      "created_at": "2026-01-19T20:20:40.532Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    },
    {
      "id": "0249c7b8-8d05-476a-aba7-f248befcec88",
      "passage_id": null,
      "paper_id": "ed0238ff-b367-4f15-bf68-6ff55239d2f0",
      "question_text": "Five jumbled up sentences, related to a topic, are given below. Four of them can be put together to form a coherent paragraph. Identify the odd one out and key in the number of the sentence as your answer: ",
      "question_type": "odd_one_out",
      "options": {
        "A": "",
        "B": "",
        "C": "",
        "D": ""
      },
      "jumbled_sentences": {
        "1": "Wolff's choice to write in German was intended to democratize philosophical knowledge, making it accessible to a wider audience.",
        "2": "The backlash against Wolff's ideas, particularly from the theological community, illustrates the tensions between philosophy and theology during the Enlightenment.",
        "3": "Despite his initial popularity, the rise of Kantian philosophy marked a turning point in the perception of Wolff's contributions.",
        "4": "The neglect of Wolff's work in later philosophical histories illustrates the shifting priorities within the discipline.",
        "5": "Wolff's mathematical method was foundational in establishing a systematic approach to philosophy, emphasizing clarity, consistency, and deductive reasoning."
      },
      "correct_answer": {
        "answer": "3"
      },
      "rationale": "The common thread is Wolff's philosophical contributions and their reception. Option 3, while discussing the rise of Kantian philosophy, shifts the focus away from Wolff's specific contributions, making it the odd one out. Options 1, 2, and 4 all relate to Wolff's impact and the tensions he faced. The misfit factor is the shift from discussing Wolff's contributions to a broader narrative about Kantian philosophy.",
      "difficulty": "medium",
      "tags": [
        "tone_and_intent_sensitivity",
        "trap_avoidance_rate"
      ],
      "created_at": "2026-01-19T20:20:40.532Z",
      "updated_at": "2026-01-19T20:23:46.889Z"
    }
  ]
}